Revit 2027 API
ViewCropRegionShapeManager.RemoveSplitRegion Method
 Removes one region in split crop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveSplitRegion(
	int regionIndex
)
Public Sub RemoveSplitRegion (
	regionIndex As Integer
)
public:
void RemoveSplitRegion(
	int regionIndex
)
member RemoveSplitRegion :
        regionIndex : int -> unit
Parameters
regionIndex Int32
 Index of region to be deleted (numbering starts with 0).
Exceptions
Exception | Condition
ArgumentException |  The provided region index cannot be deleted.
InvalidOperationException |  The crop of the associated view is not permitted to have multiple regions. -or- The view has non-rectangular crop shape set.
See Also
Reference
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace